#### Dataset for rental houses in nairobi

In [100]:
import pandas as pd

In [101]:
file_path = "data/apartments.csv"

df = pd.read_csv(file_path)

df.head()

,Unnamed: 0,title,location,bedrooms,bathrooms,price,rate
0,0,3 Bedroom Apartment / Flat to rent in Riverside,"Riverside Dr Nairobi, Riverside, Nairobi",3,3,200 000,Per Month
1,1,3 Bedroom Apartment / Flat to rent in Kileleshwa,"Kileleshwa, Nairobi",3,4,70 000,Per Month
2,2,3 Bedroom Apartment / Flat to rent in Nyali,"Links Rd Mombasa, Nyali, Mombasa",3,2,38 000,Per Month
3,3,3 Bedroom Apartment / Flat to rent in Lavington,"Near Valley Arcade, Lavington, Nairobi",3,3,80 000,Per Month
4,4,1 Bedroom Apartment / Flat to rent in Kileleshwa,"Kileleshwa, Nairobi",1,1,110 000,Per Month

#### Data preprocessing

###### drop first coloumn

In [102]:
df = df.drop(df.columns[0], axis=1)

df.head()

,title,location,bedrooms,bathrooms,price,rate
0,3 Bedroom Apartment / Flat to rent in Riverside,"Riverside Dr Nairobi, Riverside, Nairobi",3,3,200 000,Per Month
1,3 Bedroom Apartment / Flat to rent in Kileleshwa,"Kileleshwa, Nairobi",3,4,70 000,Per Month
2,3 Bedroom Apartment / Flat to rent in Nyali,"Links Rd Mombasa, Nyali, Mombasa",3,2,38 000,Per Month
3,3 Bedroom Apartment / Flat to rent in Lavington,"Near Valley Arcade, Lavington, Nairobi",3,3,80 000,Per Month
4,1 Bedroom Apartment / Flat to rent in Kileleshwa,"Kileleshwa, Nairobi",1,1,110 000,Per Month

In [103]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2520 entries, 0 to 2519
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   title      2520 non-null   object
 1   location   2144 non-null   object
 2   bedrooms   2520 non-null   int64
 3   bathrooms  2520 non-null   int64
 4   price      2520 non-null   object
 5   rate       2520 non-null   object
dtypes: int64(2), object(4)
memory usage: 118.3+ KB

In [104]:
counts = df['rate'].value_counts()

print(counts)

rate
Per Month    2395
Per Day       125
Name: count, dtype: int64

In [105]:
# Removing spaces from 'price' column
df['price'] = df['price'].str.replace(' ', '')

In [106]:

df['price'] = df['price'].astype(int) #convert price into int

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2520 entries, 0 to 2519
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   title      2520 non-null   object
 1   location   2144 non-null   object
 2   bedrooms   2520 non-null   int64
 3   bathrooms  2520 non-null   int64
 4   price      2520 non-null   int32
 5   rate       2520 non-null   object
dtypes: int32(1), int64(2), object(3)
memory usage: 108.4+ KB

In [107]:
df['price']

0       200000
1        70000
2        38000
3        80000
4       110000
         ...
2515     75000
2516     45000
2517     65000
2518    300000
2519    100000
Name: price, Length: 2520, dtype: int32

In [108]:
per_day = df[df['rate'] == 'Per Day']

per_day

,title,location,bedrooms,bathrooms,price,rate
8,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
10,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
31,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
51,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
72,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
...,...,...,...,...,...,...
2425,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
2445,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
2466,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
2488,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
2508,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day

In [109]:
df_clean = df.dropna()

df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2144 entries, 0 to 2519
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   title      2144 non-null   object
 1   location   2144 non-null   object
 2   bedrooms   2144 non-null   int64
 3   bathrooms  2144 non-null   int64
 4   price      2144 non-null   int32
 5   rate       2144 non-null   object
dtypes: int32(1), int64(2), object(3)
memory usage: 108.9+ KB

In [110]:
df_clean.isnull().sum()

title        0
location     0
bedrooms     0
bathrooms    0
price        0
rate         0
dtype: int64

In [111]:
per_day = df_clean[df_clean['rate'] == 'Per Day']

per_day

,title,location,bedrooms,bathrooms,price,rate
8,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
10,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
31,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
51,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
72,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
...,...,...,...,...,...,...
2425,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
2445,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
2466,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
2488,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
2508,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day

In [112]:
# Dropping rows where the 'rate' column is 'Per Day'
df_clean = df_clean[df_clean['rate'] != 'Per Day']

In [113]:
per_day = df_clean[df_clean['rate'] == 'Per Day']

per_day

Empty DataFrame
Columns: [title, location, bedrooms, bathrooms, price, rate]
Index: []

###### drop rate coloumn

In [114]:
df_clean = df_clean.drop('rate', axis=1)

df_clean.head()

,title,location,bedrooms,bathrooms,price
0,3 Bedroom Apartment / Flat to rent in Riverside,"Riverside Dr Nairobi, Riverside, Nairobi",3,3,200000
1,3 Bedroom Apartment / Flat to rent in Kileleshwa,"Kileleshwa, Nairobi",3,4,70000
2,3 Bedroom Apartment / Flat to rent in Nyali,"Links Rd Mombasa, Nyali, Mombasa",3,2,38000
3,3 Bedroom Apartment / Flat to rent in Lavington,"Near Valley Arcade, Lavington, Nairobi",3,3,80000
4,1 Bedroom Apartment / Flat to rent in Kileleshwa,"Kileleshwa, Nairobi",1,1,110000

In [115]:
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2019 entries, 0 to 2519
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   title      2019 non-null   object
 1   location   2019 non-null   object
 2   bedrooms   2019 non-null   int64
 3   bathrooms  2019 non-null   int64
 4   price      2019 non-null   int32
dtypes: int32(1), int64(2), object(2)
memory usage: 86.8+ KB